# Let's clean our data.
Our data is in a ```data.json``` file, so we need to fetch the data using the ```read_json()``` function from ```pandas``` to transform it into a dataframe for cleaning.

In [71]:
import json
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [30]:
df = pd.read_json('data.json')
df.head(10)

,titles,locations,prices
0,"[5 Bed House with En Suite in Kamakis, 6 Bed H...","[Kamakis, Ruiru, Lamu Town, Lamu, lamu, 0105, ...","[18,500,000, 24,000,000, 195,000,000, 22,000,0..."

**There is a problem**

Our df returns a list of titles, locations and prices instead of a singular item.
This is becuase the titles, locations and prices list are defined inside a dictionary in ```scrape.py``` by:
```python

properties = []
titles = []
locations = []
prices = []

# other code

properties.append(
    {
        "titles": titles,
        "locations": locations,
        "prices": prices
    }
)

```

So I'll need to explode it into individual lists. But I encountered a ValueError that the values of titles, locations and prices do not match, so let's check the length of each list from ```data.json```

In [31]:
with open('data.json', 'r') as f:
    data = json.load(f)

In [32]:
len(data[0]["titles"])

2458

In [33]:
len(data[0]["locations"])

2458

In [34]:
len(data[0]["prices"])

2155

**Problem identified.**

So the problem is, the length of the prices list is greater than both prices and locations.
I'll truncate the values of the ```prices``` column to the 2457th index (to capture the 2456th price) then explode to individual columns

In [35]:
max_length = df[["titles", "locations", "prices"]].applymap(len).max().max()

df['prices'] = df['prices'].apply(lambda x: x + [np.nan] * (max_length - len(x)))

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_21836\2338716464.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  max_length = df[["titles", "locations", "prices"]].applymap(len).max().max()

In [36]:
df = df.explode(["titles", "locations", "prices"]).reset_index(drop=True)
df.index = df.index + 1
df.head(10)

,titles,locations,prices
1,5 Bed House with En Suite in Kamakis,"Kamakis, Ruiru","18,500,000"
2,6 Bed House with En Suite at Lamu Town,"Lamu Town, Lamu, lamu","24,000,000"
3,3 Bed Townhouse with En Suite in Mtwapa,"0105, Mtwapa","195,000,000"
4,5 Bed Townhouse with En Suite at Lavington Green,"Maziwa, Lavington Green, Lavington","22,000,000"
5,4 Bed Townhouse with En Suite in Kileleshwa,Kileleshwa,"73,000,000"
6,5 Bed House with En Suite in Garden Estate,"Garden Estate, Roysambu","12,500,000"
7,10 Bed House with En Suite at Isaac Gathanju Road,"Isaac Gathanju Road, Lavington","81,000,000"
8,6 Bed House with En Suite at Near Sasini Factory,"Near Sasini Factory, Kiambu Road","4,000,000"
9,4 Bed House with En Suite at Greenspot Gardens,"GreenSpot Gardens, Kamakis, Ruiru","55,000,000"
10,3 Bed House with En Suite in Kitengela,Kitengela,"8,000,000"

**Cleaning of data**

I'll clean the data by:

- Removing the commas for easier conversion to float using str.replace()
- Changing the 'prices' column from an Object dtype to float64 for easier calculation.

In [37]:
df.dtypes

titles       object
locations    object
prices       object
dtype: object

In [38]:
df["prices"] = df["prices"].str.replace(',', '')
df["prices"]

1        18500000
2        24000000
3       195000000
4        22000000
5        73000000
          ...
2454          NaN
2455          NaN
2456          NaN
2457          NaN
2458          NaN
Name: prices, Length: 2458, dtype: object

In [39]:
df["prices"] = df["prices"].astype(float)
df.dtypes

titles        object
locations     object
prices       float64
dtype: object

In [40]:
df.head(10)

,titles,locations,prices
1,5 Bed House with En Suite in Kamakis,"Kamakis, Ruiru",18500000.0
2,6 Bed House with En Suite at Lamu Town,"Lamu Town, Lamu, lamu",24000000.0
3,3 Bed Townhouse with En Suite in Mtwapa,"0105, Mtwapa",195000000.0
4,5 Bed Townhouse with En Suite at Lavington Green,"Maziwa, Lavington Green, Lavington",22000000.0
5,4 Bed Townhouse with En Suite in Kileleshwa,Kileleshwa,73000000.0
6,5 Bed House with En Suite in Garden Estate,"Garden Estate, Roysambu",12500000.0
7,10 Bed House with En Suite at Isaac Gathanju Road,"Isaac Gathanju Road, Lavington",81000000.0
8,6 Bed House with En Suite at Near Sasini Factory,"Near Sasini Factory, Kiambu Road",4000000.0
9,4 Bed House with En Suite at Greenspot Gardens,"GreenSpot Gardens, Kamakis, Ruiru",55000000.0
10,3 Bed House with En Suite in Kitengela,Kitengela,8000000.0

In [41]:
df.to_csv('house_data.csv')

In [43]:
filt = df["prices"] >= 75000000
df.loc[filt]

,titles,locations,prices
3,3 Bed Townhouse with En Suite in Mtwapa,"0105, Mtwapa",195000000.0
7,10 Bed House with En Suite at Isaac Gathanju Road,"Isaac Gathanju Road, Lavington",81000000.0
16,6 Bed Villa with En Suite at Ruiru,Ruiru,135000000.0
19,4 Bed House with En Suite at Mugutha,"Mugutha, Ruiru",75000000.0
20,4 Bed House with En Suite at Rossline Lone Tree,"77, Rossline Lone tree, Rosslyn, Westlands",155000000.0
...,...,...,...
2132,4 Bed Townhouse with En Suite in Lavington,Lavington,160000000.0
2142,4 Bed Townhouse with En Suite in Nyali Area,"Nyali Area, Nyali",450000000.0
2143,5 Bed Townhouse with En Suite in Lavington,Lavington,110000000.0
2147,4 Bed House with En Suite in Limuru,Limuru,130000000.0
2152,5 Bed House with En Suite in Shanzu,Shanzu,75000000.0

**Dividing house data from lowly priced to highly priced**

I'll divide house data from low, medium to highly priced using the ```prices``` column.
This will help with:

a. Clients getting the houses that they want depending on the prices

b. Better house selection as you can get a house depending on the amount of money you have.

The prices will be categorized as so:

a. Low priced houses: From Kes 500,000 to Kes 10,000,000

b. Medium priced houses: From Kes 10,000,000 to Kes 75,000,000

c. Highly priced houses: From Kes 75,000,000 onwards

d. Houses with no price value. I'll add contacts for this houses once I get a way to get them.

In [55]:
# the above 'filt' variable contains all houses in the Highly Priced category.
# converting it into a dataframe by itself to move into a db

high_price_df = df.loc[filt]
high_price_df = high_price_df.reset_index(drop=True)
high_price_df.index = high_price_df.index + 1
high_price_df.head(5)

,titles,locations,prices
1,3 Bed Townhouse with En Suite in Mtwapa,"0105, Mtwapa",195000000.0
2,10 Bed House with En Suite at Isaac Gathanju Road,"Isaac Gathanju Road, Lavington",81000000.0
3,6 Bed Villa with En Suite at Ruiru,Ruiru,135000000.0
4,4 Bed House with En Suite at Mugutha,"Mugutha, Ruiru",75000000.0
5,4 Bed House with En Suite at Rossline Lone Tree,"77, Rossline Lone tree, Rosslyn, Westlands",155000000.0

In [57]:
# Let's load it into an excel sheet.
high_price_df.to_excel('high_priced_houses.xlsx')

In [62]:
# Let's get all medium priced houses and convert them into a df
filt2 = (df['prices'] <= 75000000) & (df['prices'] > 5000000)
df.loc[filt2]

,titles,locations,prices
1,5 Bed House with En Suite in Kamakis,"Kamakis, Ruiru",18500000.0
2,6 Bed House with En Suite at Lamu Town,"Lamu Town, Lamu, lamu",24000000.0
4,5 Bed Townhouse with En Suite at Lavington Green,"Maziwa, Lavington Green, Lavington",22000000.0
5,4 Bed Townhouse with En Suite in Kileleshwa,Kileleshwa,73000000.0
6,5 Bed House with En Suite in Garden Estate,"Garden Estate, Roysambu",12500000.0
...,...,...,...
2151,5 Bed House with En Suite in Nyali Area,"Nyali Area, Nyali",9500000.0
2152,5 Bed House with En Suite in Shanzu,Shanzu,75000000.0
2153,4 Bed Villa with Swimming Pool in Diani,Diani,37500000.0
2154,5 Bed House with En Suite in Ongata Rongai,Ongata Rongai,50000000.0
2155,4 Bed House with En Suite at Eliud Mathu,"678, Eliud Mathu, Runda, Westlands",45000000.0

In [63]:
medium_price_df = df.loc[filt2]
medium_price_df.head(5)

,titles,locations,prices
1,5 Bed House with En Suite in Kamakis,"Kamakis, Ruiru",18500000.0
2,6 Bed House with En Suite at Lamu Town,"Lamu Town, Lamu, lamu",24000000.0
4,5 Bed Townhouse with En Suite at Lavington Green,"Maziwa, Lavington Green, Lavington",22000000.0
5,4 Bed Townhouse with En Suite in Kileleshwa,Kileleshwa,73000000.0
6,5 Bed House with En Suite in Garden Estate,"Garden Estate, Roysambu",12500000.0

In [64]:
medium_price_df = medium_price_df.reset_index(drop=True)
medium_price_df.index = medium_price_df.index + 1
medium_price_df.head(5)

,titles,locations,prices
1,5 Bed House with En Suite in Kamakis,"Kamakis, Ruiru",18500000.0
2,6 Bed House with En Suite at Lamu Town,"Lamu Town, Lamu, lamu",24000000.0
3,5 Bed Townhouse with En Suite at Lavington Green,"Maziwa, Lavington Green, Lavington",22000000.0
4,4 Bed Townhouse with En Suite in Kileleshwa,Kileleshwa,73000000.0
5,5 Bed House with En Suite in Garden Estate,"Garden Estate, Roysambu",12500000.0

In [66]:
medium_price_df.to_excel('medium_priced_houses.xlsx')

In [67]:
# Let's get houses below 5000000 Kes which will be labeled as Lowly priced houses

filt3 = df['prices'] < 5000000
df.loc[filt3]

,titles,locations,prices
8,6 Bed House with En Suite at Near Sasini Factory,"Near Sasini Factory, Kiambu Road",4000000.0
18,4 Bed Townhouse with En Suite at Rossline Lone...,"65, Rossline Lone tree, Rosslyn, Westlands",80000.0
156,4 Bed House with En Suite at Mugutha,"Mugutha, Ruiru",4900000.0
168,5 Bed Townhouse with En Suite in Lavington,Lavington,4800000.0
1492,5 Bed House with En Suite at Nyali Mombasa,"Nyali Mombasa, Nyali Mombasa, Nyali Area, Nyali",4000000.0
1905,3 Bed House with En Suite in Kitengela,Kitengela,4200000.0

In [68]:
low_price_df = df.loc[filt3]
low_price_df

,titles,locations,prices
8,6 Bed House with En Suite at Near Sasini Factory,"Near Sasini Factory, Kiambu Road",4000000.0
18,4 Bed Townhouse with En Suite at Rossline Lone...,"65, Rossline Lone tree, Rosslyn, Westlands",80000.0
156,4 Bed House with En Suite at Mugutha,"Mugutha, Ruiru",4900000.0
168,5 Bed Townhouse with En Suite in Lavington,Lavington,4800000.0
1492,5 Bed House with En Suite at Nyali Mombasa,"Nyali Mombasa, Nyali Mombasa, Nyali Area, Nyali",4000000.0
1905,3 Bed House with En Suite in Kitengela,Kitengela,4200000.0

In [69]:
low_price_df = low_price_df.reset_index(drop=True)
low_price_df.index = low_price_df.index + 1
low_price_df

,titles,locations,prices
1,6 Bed House with En Suite at Near Sasini Factory,"Near Sasini Factory, Kiambu Road",4000000.0
2,4 Bed Townhouse with En Suite at Rossline Lone...,"65, Rossline Lone tree, Rosslyn, Westlands",80000.0
3,4 Bed House with En Suite at Mugutha,"Mugutha, Ruiru",4900000.0
4,5 Bed Townhouse with En Suite in Lavington,Lavington,4800000.0
5,5 Bed House with En Suite at Nyali Mombasa,"Nyali Mombasa, Nyali Mombasa, Nyali Area, Nyali",4000000.0
6,3 Bed House with En Suite in Kitengela,Kitengela,4200000.0

In [70]:
low_price_df.to_excel('low_priced_houses.xlsx')

# Moving the data into a PostgresQL database using ```create_engine```

Moving the data into a PostgresQL database using SQLAlchemy's ```create_engine``` which will create an engine based on a URL which will be an identifier for the PostgresQL database.

In [74]:
engine = create_engine('postgresql://avnadmin:xxxx_xxxxxxxxxxxxxxxxxxx@xxxxxxxxxxxxxxxxxxxxx/defaultdb?sslmode=require')

In [75]:
df.to_sql(name='house_data', con=engine)

458